t21/Walnut_X/Packages/.cache/Keil.EFM32TGxxx_DFP.1.2.0.pdsc
      <component Cgroup="CORE" condition="EFM32TG BSP core">
        <description>Silicon Labs BSP Core</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_STK3300
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32tg/html/group__Drivers.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/bsp/bsp.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_bcc.c"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_stk.c"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_stk_leds.c"/>
          <file category="header"  name="Boards/SiliconLabs/common/bsp/bsp_trace.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_trace.c"/>
          <file category="include" name="Boards/SiliconLabs/EFM32TG_STK3300/config/"/>
        </files>
      </component>

      <component Cgroup="LED" Capiversion="1.00" condition="EFM32TG BSP">
        <description>LED interface for Silicon Labs EFM32TG-STK3300 Development Kit</description>
        <files>
          <file category="source"  name="Boards/SiliconLabs/EFM32TG_STK3300/Common/LED_STK3300.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="EFM32TG BSP">
        <description>Buttons interface for Silicon Labs EFM32TG-STK3300 Development Kit</description>
        <files>
          <file category="source"  name="Boards/SiliconLabs/EFM32TG_STK3300/Common/Buttons_STK3300.c"/>
        </files>
      </component>
    </bundle>
  </components>

  <boards>
    <board vendor="Silicon Labs" name="EFM32TG-STK3300" revision="Ver 1.0">
      <description>Silicon Labs EFM32TG Starter Kit</description>
      <image small="Boards/SiliconLabs/EFM32TG_STK3300/Documents/efm32tg-stk3300_small.jpg"
             large="Boards/SiliconLabs/EFM32TG_STK3300/Documents/efm32tg-stk3300_large.jpg"/>
      <book category="overview"  name="http://www.silabs.com/products/mcu/lowpower/pages/efm32tg-stk3300.aspx" title="EFM32TG-STK3300 Web Page"/>
      <book category="manual"    name="Boards/SiliconLabs/EFM32TG_STK3300/Documents/efm32_tiny_gecko_stk_user_manual.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Silicon Labs:21" Dname="EFM32TG840F32"/>
      <compatibleDevice deviceIndex="0" Dvendor="Silicon Labs:21" DsubFamily="EFM32TG840"/>
      <feature type="Button"     n="3"             name="Push-buttons: Reset, 2x User"/>
      <feature type="LED"        n="6"             name="LEDs: 4x Status, 1x User"/>
      <feature type="DIO"                          name="Breakout pads for easy access to I/O pins"/>
      <feature type="DIO"                          name="20 pin expansion header"/>
      <feature type="Touch"      n="1"             name="Capacitive touch slider"/>
      <feature type="LCD"        n="1"  m="8.20"   name="160 segment Energy Micro LCD"/>
      <feature type="LightSens"  n="1"             name="Ambient Light Sensor"/>
      <feature type="PWR"        n="5"             name="USB Powered"/>
      <feature type="Batt"       n="1"             name="CR2032 battery"/>
      <feature type="ODbg"       n="1"             name="Onboard SEGGER J-Link USB debugger"/>
    </board>
  </boards>

  <examples>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/SiliconLabs/EFM32TG_STK3300/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="EFM32TG-STK3300" vendor="Silicon Labs"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
